Revit 2027 API
BuiltInFailures.ColumnInsideWallFailures.StartCutShadowJoin Property
 Two joined walls are in a position to allow automatic insert copying.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StartCutShadowJoin { get; }
Public Shared ReadOnly Property StartCutShadowJoin As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StartCutShadowJoin {
	FailureDefinitionId^ get ();
}
static member StartCutShadowJoin : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace